#include "../includes/printMenu.h"
#include "stdlib.h"
#include <stdio.h>

// --------------------------------------------
// displayMenu
// --------------------------------------------


void displayMenu(){
    puts(   "   >------------------------------------------------------------------------------------------------------<\n\n"
            "                                                     MENU                                                  \n\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 1 | Resumo do perfil de um user ou condutor.                                                         |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 2 | Listar os N condutores com maior avaliação média.                                                |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 3 | Listar os N utilizadores com maior distância percorrida.                                         |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 4 | Preço médio das viagens(sem gorjeta) numa dada cidade.                                           |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 5 | Preço médio das viagens(sem gorjeta) num dado intervalo de tempo.                                |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 6 | Distância média percorrida, numa dada cidade, num dado intervalo de tempo.                       |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 7 | Listar os top N condutores de uma cidade.                                                        |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 8 | Listar as viagens cujo condutor e passageiro são do genero dado e têm perfis com X ou mais anos. |\n"
            "   >------------------------------------------------------------------------------------------------------<\n"
            "   | 9 | Listar as viagens nas quais o passageiro deu gorjeta num dado intervalo de tempo.                |\n"
            "   >------------------------------------------------------------------------------------------------------<\n\n");

}

void displayMenu8024(){
    puts(   "                                      MENU                                    \n"
            ">------------------------------------------------------------------------------<\n"
            " | 1 | Resumo do perfil de um user ou condutor.                              |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 2 | Top N condutores com maior avaliação média.                           |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 3 | Top N utilizadores com maior distância percorrida.                    |\n"
            ">-------------------- ---------------------------------------------------------<\n"
            " | 4 | Preço médio das viagens(sem gorjeta) numa dada cidade.                |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 5 | Preço médio das viagens(sem gorjeta) num dado intervalo de tempo.     |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 6 | Distância média percorrida,numa dada cidade,num Intervalo de tempo.   |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 7 | Top N condutores de uma cidade.                                       |\n"
            ">------------------------------------------------------------------------------<\n"
            " | 8 | Viagens onde ambos utilizadores tem o mesmo genero,com x+anos de conta|\n"
            ">------------------------------------------------------------------------------<\n"
            " | 9 | Listar as viagens nas quais houve gorjeta num intervalo de tempo.     |\n"
            ">------------------------------------------------------------------------------<\n"
            "          [C] Creditos                                        [Q] Sair \n"
            ">------------------------------------------------------------------------------<\n");

}



// --------------------------------------------
// printPaginacao
// --------------------------------------------


void printPaginacao(){
    puts(   "   >------------------------------------------------------------------------------------------------------<\n"
            "                    [C] Creditos                                        [Q] Sair \n"
            "   >------------------------------------------------------------------------------------------------------<\n");
}



void printPaginacao8024(){
    puts(   ">------------------------------------------------------------------------------<\n"
            "          [C] Creditos                                        [Q] Sair \n"
            ">------------------------------------------------------------------------------<\n");
}






// --------------------------------------------
// printPaginacao2
// --------------------------------------------


void printPaginacao2(int pag,int pagMax){
    printf("   >------------------------------------------------------------------------------------------------------<\n");
    printf("            [A] Anterior          [P] Proxima              [%i/%i]  Pagina                [V] Voltar \n",pag,pagMax);
    printf("   >------------------------------------------------------------------------------------------------------<\n");
}

// --------------------------------------------
// printPaginacao28024
// --------------------------------------------

void printPaginacao28024(int pag,int pagMax){
    printf(">------------------------------------------------------------------------------<\n");
    printf("     [A] Anterior      [P] Proxima         [%i/%i]  Pagina       [V] Voltar \n",pag,pagMax);
    printf(">------------------------------------------------------------------------------<\n");
}

// --------------------------------------------
// printVoltar
// --------------------------------------------

void printVoltar(){
    puts("   >------------------------------------------------------------------------------------------------------<\n"
         "                                                  [V] Voltar\n"
         "   >------------------------------------------------------------------------------------------------------<\n");
}


void printVoltar8024(){
    puts(">------------------------------------------------------------------------------<\n"
         "                                  [V] Voltar\n"
         ">------------------------------------------------------------------------------<\n");
}



// --------------------------------------------
// printUpper
// --------------------------------------------

void printUpper(){
    puts("   >------------------------------------------------------------------------------------------------------<\n"
         "                                                      LI3\n"
         "   >------------------------------------------------------------------------------------------------------<\n");

}

void printUpper8024(){
    puts(">------------------------------------------------------------------------------<\n"
         "                                       LI3\n"
         ">------------------------------------------------------------------------------<\n");

}



// --------------------------------------------
// clear_screen
// --------------------------------------------

void clear_screen(){
        if(system("clear")==-1);
}


// --------------------------------------------
// errorMsg
// --------------------------------------------

void errorMsg(int querry){
    switch (querry) {
        case 1:{
            printf("      O id/username inserido não existe.\n");
            break;
        }
        case 2:{
            printf("      A quantidade de condutores deve ser um número inteiro.\n");
            break;
        }
        case 3:{
            printf("      A quantidade de utilizadores deve ser um número inteiro.\n");
            break;
        }
        case 4:{
            printf("      A cidade inserida não existe.\n");
            break;
        }
        case 5:{
            printf("      Nao existem viagem nesse intervalo de tempo.\n");
            break;
        }
        case 6:{
            printf("      Nao existem viagem nesse intervalo de tempo, nessa cidade.\n");
            break;
        }
        case 7:{
            printf("      O numero ou cidade nao existe ou foi mal inserido.\n");
            break;
        }
        case 8:{
            printf("      Para essa idade de perfil e genero nao existem viagens.\n");
            break;
        }
        case 9:{
            printf("      Nesse intervalo de tempo nao existem viagem com Tips.\n");
            break;
        }
        default:{
            printf("      Algo está errado\n");
            break;
        }
    }
}

// --------------------------------------------
// printCreditos
// --------------------------------------------

void printCreditos(){
        printf("Creditos:\n");
        printf("Diogo Silva.    A97941\n");
        printf("Rafael Peixoto. A96807\n");
        printf("\n");

        printVoltar();
}

// --------------------------------------------
// printLinha
// --------------------------------------------

void printLinha(int linha){
    for (int i = 0; i <= linha; i++) {
        printf("\n");
    }
}